
[[Number-Equal]]
# Number Equal
:concept: Expressions/Values/Number/Equal

.Synopsis
Equality operator on numeric values.

.Syntax
`_Exp_~1~ == _Exp_~2~`

.Types


|====
| `_Exp~1~_`  |  `_Exp~2~_` | `_Exp~1~_ == _Exp~2~_`  

| `int`      |  `int`     | `bool`                
| `int`      |  `real`    | `bool`                
| `real`     |  `real`    | `bool`                
|====

.Function

.Description
Yields `true` if the value of both arguments is numerically equal, and `false` otherwise.

.Examples
[source,rascal-shell]
----
rascal>12 == 12
bool: true
rascal>12 == 12.0
bool: true
rascal>12 == 13
bool: false
rascal>12 == 13.0
bool: false
rascal>3.14 == 3.14
bool: true
rascal>3.14 == 3
bool: false
----

.Benefits

.Pitfalls


:leveloffset: +1

:leveloffset: -1