[[List-Insert]]
# List Insert
:concept: Expressions/Values/List/Insert

.Synopsis
add an element in front of a list

.Syntax

.Types

//

|====
| `_Exp~1~_`     |  `_Exp~2~_`     | `_Exp~1~_ + _Exp~2~_`      

| `_T~1~_`       |  `list[_T~2~_]` | `list[lub(_T~1~_,_T~2~_)]` 
|====

.Function

.Description

The `+` operator can insert an element in front of a list. Note that `+` is one of the <<Operators>> that is overloaded, it is also <<List-Concatenation>> and <<List-Append>> for example.

.Examples

[source,rascal-shell]
----
rascal>1 + []
list[int]: [1]
rascal>1 + [2]
list[int]: [1,2]
rascal>1 + [2,3]
list[int]: [1,2,3]
----

.Benefits

.Pitfalls

*  If the first operand before the `+` is a list, `+` acts as <<List Concatenation>> and not as <<List Insert>>

This is concatenation:
[source,rascal-shell]
----
rascal>[1] + [2]
list[int]: [1,2]
----
To insert a list as an element, use extra brackets:
[source,rascal-shell]
----
rascal>[[1]] + [2]
list[value]: [
  [1],
  2
]
----


:leveloffset: +1

:leveloffset: -1